In [3]:
import pandas as pd

In [4]:
x = ['Python','Pandas']

In [5]:
df = pd.DataFrame(x)

In [6]:
df

        0
0  Python
1  Pandas

In [7]:
info = {'Id': [101, 102, 103],'Department':['B.Sc','Btech','Mtech']}

In [8]:
info

{'Id': [101, 102, 103], 'Department': ['B.Sc', 'Btech', 'Mtech']}

In [9]:
df = pd.DataFrame(info)

In [10]:
df

    Id Department
0  101       B.Sc
1  102      Btech
2  103      Mtech

In [15]:
df.index = ["A","B","C"]

    Id Department
A  101       B.Sc
B  102      Btech
c  103      Mtech

In [14]:
df

    Id Department
A  101       B.Sc
B  102      Btech
c  103      Mtech

In [16]:
df.index = ["A","B","C"]
df

    Id Department
A  101       B.Sc
B  102      Btech
C  103      Mtech